Revit 2026 API

# SpatialFieldManagerNumberOfMeasurements Property

---

Stores the total number of measurements

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumberOfMeasurements { get; }
```
```vb
Public ReadOnly Property NumberOfMeasurements As Integer
	Get
```
```cpp
public:
property int NumberOfMeasurements {
	int get ();
}
```
```fsharp
member NumberOfMeasurements : int with get
```

#### Property Value

Int32

This number defines the length of value arrays in ValueAtPoint objects

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace